<?
$StoreName = "撲克王 PokerKing";
$HTTPTitle = $StoreName."-後台系統";
//-------------------------------------------------------------
$mess[0] = "很抱歉！這個帳號已經有人使用，請選其他帳號。";
$mess[1] = "登入失敗！請重新登入。";
$mess[2] = "您的記錄中已存在此電子郵件，不必要重複確定。";
$mess[3] = "編輯會員成功。";
$mess[4] = "您的操作權限不足，請洽系統管理員。";
$mess[5] = "操作成功!";
$mess[6] = "刪除成功。";
$mess[7] = "測試郵件送出成功。";
$mess[8] = "功能尚未開啟，請稍後再試。";
$mess[9] = "登入成功";
$mess[10] = "登入失敗";
$mess[11] = "註冊成功，感謝您！";
$mess[12] = "您已登入成功，無須重覆登入！！";
$mess[13] = "郵件發送完畢";
$mess[14] = "共發送了：";
$mess[15] = "封已發送過!!";
$mess[16] = "原密碼輸入不正確!!";
$mess[17] = "系統找不到此訂單編號!!!";
$mess[18] = "[訂閱]成功!!!";
$mess[19] = "[取消訂閱]成功!!!";
$mess[20] = "系統查不到您的電子郵件!!";
$mess[21] = "帳號或密碼錯誤！！";
$mess[22] = "資料修改成功！！";
$mess[23] = "您所輸入原始密碼錯誤！！此次修改密碼失敗！";
$mess[24] = "請先登入會員！！";
$mess[25] = "您已投票過了！請勿重覆投票！！";
$mess[26] = "投票成功！感謝您！！";
$mess[27] = "請先登入會員！！";
$mess[28] = "訪客";
$mess[29] = "發表成功!!";
$mess[30] = "回覆成功!!";
$mess[31] = "您尚未開通「至尊撲克王」遊戲!!登入失敗!!";
$mess[32] = "貨號已存在，請勿重覆!!";
//-------------------------------------------------------------
//---
$a_week=array("日","一","二","三","四","五","六");
$p_newsclass=array("總新聞","頭條新聞","每日一聞","即時報","高視聚焦","Kuro新聞","玩新聞","跑馬燈");
$p_popclass=array("總廣告","置中廣告","右上廣告","右下廣告");

$p_income=array("--- 請選擇 ---","無","9,999以下","10,000-19,999","20,000-29,999","30,000-39,999","40,000-49,999","50,000-59,999","60,000-69,999","70,000-79,999","80,000-89,999","90,000-99,999","100,000以上");

$iclass_array=array("公告","重要","活動");

$sale_class = array("1"=>"銷售","2"=>"補貨中","3"=>"停售","4"=>"歡迎洽詢","0"=>"隱藏");
$sale_id = array("1","2","3","4","0");

$sale_pay_class = array("Web","現場","全部");
//$sale_pay_code = array(""/*網路轉帳*/,"WC"/*網路信用卡*/,"LL"/*現場*/);
$sale_pay_code = array("C"/*網路銷售*/,"Z"/*現場*/);
?>